Revit 2027 API
RibbonPanel.AddSeparator Method
Adds a new Separator to the panel.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSeparator()
Public Sub AddSeparator
public:
void AddSeparator()
member AddSeparator : unit -> unit
Remarks
The separator won't be shown if there are no items already added to the panel.
See Also
Reference
RibbonPanel Class
Autodesk.Revit.UI Namespace